src/cf/DataProcessors/вогУправлениеКлассификацией.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<DataProcessor>
		<Properties>
			<Name>вогУправлениеКлассификацией</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Корзина</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяСписка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/CRM_ОбъектыЗначенийКлассификаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_ОбъектыЗначенийКлассификаторов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_ДополнительныеРеквизитыКлассификаторов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.вогАнкета</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.CRM_БизнесПроцесс</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_Классификаторы</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_АналитикаКлассификаторов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеКлассификатора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЗначенияКлассификаторов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/CRM_ВидыОтображенияКлассификаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_ВидыОтображенияКлассификаторов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тег</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вхождение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдиночноеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтдельнымСписком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщимСписком</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>Не переносить в объединенные решения</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Comment>Не переносить в объединенные решения</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяПозиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогНоменклатурныеПозиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаХраненияОстатков</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДляОтчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогПроизводитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьвогУниверсальнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьвогЕдиницаИзмеренияМест</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬвогКоллекцияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогКоллекцииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬСпособПополнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСнятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойАртикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Панно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСоставныхЭлементов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаСоставногоЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаСоставногоЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогСтатусыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогРейтингиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогУсловияХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТовараДляWMS</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВидыТовараДляWMS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУпаковки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВидыУпаковки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогЦветПроизводителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогЦветаПроизводителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоТиража</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеновойСегментФабрики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогЦеновойСегментФабрики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогЦеноваяГруппа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассификаторМатрицы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМатриц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>вогСоставМозаики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧипов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Компаньоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компаньон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Коллекции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Удалить_Коллекция</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоллекцияПроизводителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КоллекцииНоменклатурыПроизводителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/вогУправлениеКлассификацией/Forms/ФормаНоменклатураСтарая/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	//Режим подбора
	Если Параметры.Свойство("РежимПодбора", РежимПодбора)
	  И РежимПодбора Тогда
		Элементы.Список.РежимВыбора = Истина;
		СтандартныеПодсистемыСервер.УстановитьКлючНазначенияФормы(ЭтотОбъект, "ВыборПодбор");		
	КонецЕсли;
	Элементы.Выбрать.Видимость = РежимПодбора;
	
	времНастройки = CRM_ХранилищеНастроек.Загрузить(ЭтотОбъект.ИмяФормы, "Настройки");
	Настройки = ?(времНастройки = Неопределено, ПолучитьНастройкиПоУмолчанию(), времНастройки);
	
	//Формирование вариантов списка
	ПараметрыСписка = ПолучитьПараметрыСписка();
	
	ТекущаяНастройка	 = Новый Структура(ПараметрыСписка.ИмяСписка);
	ТекущийВариантСписка = Новый Структура(ПараметрыСписка.ИмяСписка);
	CRM_КлассификаторыВызовСервера.ИнициализироватьВариантыСписка(ЭтотОбъект, ПараметрыСписка);
	
	ОтборДатаВключенияКлассификатораВидСравнения = "Равно";
	ОтборПродажиСуммаВидСравнения				 = "Равно";
		
	Если Параметры.Свойство("Классификатор") Тогда
		Классификатор = Параметры.Классификатор;
		ИницализироватьСтруктуруКлассификатора();
		
	КонецЕсли;
		
	УстановитьПараметрыСписковПоНастройкам(ЭтаФорма);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Классификатор", Классификатор);
	
	Если Параметры.Свойство("МассивОбъектовКлассификаторов")
	  И Параметры.МассивОбъектовКлассификаторов.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
			"Ссылка", Параметры.МассивОбъектовКлассификаторов, ВидСравненияКомпоновкиДанных.ВСписке);
		
		РежимСписка = Истина;
		Заголовок   = НСтр("ru = 'Установлен дополнительный отбор'");
		
	КонецЕсли;	
	
	//Настройки
	СформироватьЗаголовокПоНастройке(ЭтотОбъект);
	
	//+Рабочий стол
	скРабочийСтолСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ);
	//-Рабочий стол
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	//Настройки
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.вогНастройкиУправленияКлассификацией") Тогда
		ТекущаяНастройка["СписокНоменклатура"] = ВыбранноеЗначение;	
		ИнициализироватьФормуПоНастройкеКлиент();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьРежимПросмотраСписка();
	РежимСписка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьВариантаСпискаКлассификации" Тогда
		ИнициализироватьВариантыСписка(Источник, Параметр)
	КонецЕсли;
	
	Если ИмяСобытия = "ЗаписьНастройкиКлассификации" Тогда
		Если ТекущаяНастройка.Свойство(Источник) Тогда
			ТекущаяНастройка[Источник] = Параметр;
			СформироватьЗаголовокПоНастройке(ЭтотОбъект);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьОтборПоКлассификаторам(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Принадлежность"	 	  , "Справочник.Номенклатура");
	ПараметрыФормы.Вставить("МассивЗначений"	 	  , ОтборСписокЗначенийКлассификаторов.ВыгрузитьЗначения());
	ПараметрыФормы.Вставить("МассивЗначенийРеквизитов", ОтборСписокЗначенийРеквизитовКлассификаторов.ВыгрузитьЗначения());
	ПараметрыФормы.Вставить("ЛогическоеВыражение"	  , ЛогическоеВыражениеОтбораКлассификаторов);
	
	Оповещение = Новый ОписаниеОповещения("НастроитьОтборПоКлассификаторамЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.CRM_ФормаПодбораЗначенийКлассификаторов", 
		ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборПоКлассификаторамЗавершение(СтруктураЗначенийКлассификаторов, ДополнительныеПараметры) Экспорт

	Если СтруктураЗначенийКлассификаторов = Неопределено Тогда
		Возврат;
	
	КонецЕсли;	
	
	ЛогическоеВыражениеОтбораКлассификаторов = СтруктураЗначенийКлассификаторов.ЛогическоеВыражение;
	УстановитьОтборПоКлассификаторам(СтруктураЗначенийКлассификаторов.ЗначенияКлассификаторов, СтруктураЗначенийКлассификаторов.ЗначенияРеквизитов);
		
КонецПроцедуры // НастроитьОтборПоКлассификаторамЗавершение()

&НаКлиенте
Процедура НазначитьВыделенным(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	
	КонецЕсли;
	
	Для каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
		Если ДанныеСтроки = Неопределено Тогда                      
			Продолжить;
		КонецЕсли;
		
		Если ДанныеСтроки.ЭтоГруппа Тогда
			Возврат;	
		КонецЕсли;		
		
		Если Элементы.Список.ТекущийЭлемент.Родитель = Элементы.ПоляЗначенийКлассифкатора Тогда
			ОбработатьДанныеСтрокиКлиент(ДанныеСтроки, Элементы.Список.ТекущийЭлемент.Имя, Ложь);
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#Область Настройки
	
&НаКлиенте
Процедура Настройки(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Настройки", Настройки);
	
	Оповещение = Новый ОписаниеОповещения("НастройкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.вогУправлениеКлассификацией.Форма.ФормаНастроек",
		ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗавершение(ПолученныеНастройки, Контекст) Экспорт

	Если ПолученныеНастройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНастройки(ПолученныеНастройки);	
	УстановитьПараметрыСписковПоНастройкам(ЭтаФорма);

КонецПроцедуры // НастройкиЗавершение()

&НаКлиенте
Процедура ВыбратьНастройку(Команда)
		
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяСписка", "СписокНоменклатура");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор"		 , Отбор);
	ПараметрыФормы.Вставить("Пользватель", ПользователиКлиентСервер.ТекущийПользователь());
	
	ОткрытьФорму("Справочник.вогНастройкиУправленияКлассификацией.ФормаВыбора",
		ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройку(Команда)
	
	ПараметрыНастройки = Новый Структура;
	
	//Основные настройки
	ПараметрыНастройки.Вставить("ВариантСписка", ТекущийВариантСписка["СписокНоменклатура"]);
	ПараметрыНастройки.Вставить("Классификатор", Классификатор);
	
	ПараметрыНастройки.Вставить("ОтборСписокЗначенийКлассификаторов"	  , ОтборСписокЗначенийКлассификаторов);
	ПараметрыНастройки.Вставить("ЛогическоеВыражениеОтбораКлассификаторов", ЛогическоеВыражениеОтбораКлассификаторов);
	
	//Быстрые отборы
	СтруктураБыстрыхОтборов = Новый Структура;
	
	СтруктураБыстрыхОтборов.Вставить("ОтборДатаВключенияКлассификатора"			   , ОтборДатаВключенияКлассификатора);
	СтруктураБыстрыхОтборов.Вставить("ОтборДатаВключенияКлассификатораВидСравнения", ОтборДатаВключенияКлассификатораВидСравнения);
	СтруктураБыстрыхОтборов.Вставить("ОтборНоменклатурнаяГруппа"				   , ОтборНоменклатурнаяГруппа);
	СтруктураБыстрыхОтборов.Вставить("ОтборПродажиСумма"						   , ОтборПродажиСумма);
	СтруктураБыстрыхОтборов.Вставить("ОтборПродажиСуммаВидСравнения"			   , ОтборПродажиСуммаВидСравнения);
	СтруктураБыстрыхОтборов.Вставить("ОтборСписокЗначенийКлассификаторов"		   , ОтборСписокЗначенийКлассификаторов);
	СтруктураБыстрыхОтборов.Вставить("ОтборНаправлениеДеятельности"				   , ОтборНаправлениеДеятельности);	
	
	ПараметрыНастройки.Вставить("БыстрыеОтборы", СтруктураБыстрыхОтборов);
	
	//Сохранение настройки
	ОткрытьФорму("Справочник.вогНастройкиУправленияКлассификацией.Форма.СохранениеНастройки",
		Новый Структура("ИмяСписка, Настройки", "СписокНоменклатура", ПараметрыНастройки), ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Выбрать(Команда)
	ОповеститьОВыборе(Элементы.Список.ВыделенныеСтроки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КлассификаторПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("Подключаемый_ИницализироватьСтруктуруКлассификатора", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ДанныеСтроки = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
	Если ДанныеСтроки = Неопределено Тогда                      
		Возврат;
	КонецЕсли;
	
	Если ДанныеСтроки.ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли;
	
	Если Поле.Родитель = Элементы.ПоляЗначенийКлассифкатора Тогда
		ОбработатьДанныеСтрокиКлиент(ДанныеСтроки, Поле.Имя, СтандартнаяОбработка);
		Элемент.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

#Область БыстрыеОтборы
	
&НаКлиенте
Процедура ОтборНаправлениеДеятельностиПриИзменении(Элемент)
	УстановитьБыстрыеОтборы();	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНоменклатурнаяГруппаПриИзменении(Элемент)
	УстановитьБыстрыеОтборы();	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаВключенияКлассификатораПриИзменении(Элемент)
	УстановитьБыстрыеОтборы();	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПродажиСуммаПриИзменении(Элемент)
	УстановитьБыстрыеОтборы();	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаВключенияКлассификатораВидСравненияПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма[Элемент.Имя]) Тогда
		ЭтаФорма[Элемент.Имя] = "Равно";
	КонецЕсли;
	
	УстановитьБыстрыеОтборы();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПродажиСуммаВидСравненияПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма[Элемент.Имя]) Тогда
		ЭтаФорма[Элемент.Имя] = "Равно";
	КонецЕсли;
	
	УстановитьБыстрыеОтборы();	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПодключаемыеПроцедурыФункции

&НаКлиенте
Процедура Подключаемый_ИницализироватьСтруктуруКлассификатора()

	ИницализироватьСтруктуруКлассификатора();	

КонецПроцедуры // Подключаемый_ИницализироватьСтруктуруКлассификатора()

&НаКлиенте
Процедура Подключаемый_ЗначениеОтбора_ОбработкаСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;		
	ЭлементЗначенияОтбора = ОтборСписокЗначенийКлассификаторов.НайтиПоЗначению(
		СсылкаЭлемента(Элемент.Имя));	
		
	Если ЭлементЗначенияОтбора = Неопределено Тогда
		Возврат;	
		
	КонецЕсли;	
	
	ИндексЭлементЗначенияОтбора = ОтборСписокЗначенийКлассификаторов.Индекс(ЭлементЗначенияОтбора);
	
	ОтборСписокЗначенийКлассификаторов.Удалить(ИндексЭлементЗначенияОтбора);
	ОтборСписокЗначенийРеквизитовКлассификаторов.Удалить(ИндексЭлементЗначенияОтбора);
	
	УстановитьОтборПоКлассификаторам();
	
КонецПроцедуры // Подключаемый_ЗначениеОтбора_ОбработкаСсылки()

#Область ВариантыСписка

&НаКлиенте
Процедура Подключаемый_ВариантСпискаПриИзменении(Команда)
	ВариантСпискаПриИзменении(Команда.Имя);
КонецПроцедуры // Подключаемый_ВариантСпискаПриИзменении()

&НаКлиенте
Процедура Подключаемый_ДобавитьВариантСписка(Команда)
		
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ИмяСписка", "СписокНоменклатура");
	
	ОткрытьФорму("Справочник.вогВариантыСписковУправленияКлассификацией.ФормаОбъекта",
		Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ЭтотОбъект, УникальныйИдентификатор);
	
	КонецПроцедуры // Подключаемый_ДобавитьВариантСписка()
	
#КонецОбласти

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаСервере
Процедура ИницализироватьСтруктуруКлассификатора()
	СформироватьВыбранныеПоля();	
КонецПроцедуры // ИницализироватьСтруктуруКлассификатора()

&НаСервере
Процедура СформироватьВыбранныеПоля()
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Классификатор", Классификатор);
	
	ИмяТаблицы = "Список";
	Для каждого СтрокаСоответстствия Из ТаблицаСоответстствияПолей Цикл
		Элемент = Элементы.Найти(СтрокаСоответстствия.ИмяПоля);	
		Если Элемент <> Неопределено Тогда
			Элементы.Удалить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаСоответстствияПолей.Очистить();
	
	Если Не ЗначениеЗаполнено(Классификатор) Тогда
		Возврат;	
		
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Классификатор", Классификатор);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_ЗначенияКлассификаторов.Ссылка,
		|	CRM_ЗначенияКлассификаторов.Код,
		|	CRM_ЗначенияКлассификаторов.Владелец.ИспользуемаяАналитика КАК ИспользуемаяАналитика,
		|	CRM_ЗначенияКлассификаторов.Владелец.Наименование КАК ВладелецНаименование,
		|	CRM_ЗначенияКлассификаторов.Представление,
		|	CRM_ЗначенияКлассификаторов.Владелец.ВидОтображения КАК ВидОтображения,
		|	CRM_ЗначенияКлассификаторов.Описание,
		|	CRM_ЗначенияКлассификаторов.ДополнительныйРеквизит,
		|	CRM_ЗначенияКлассификаторов.ДополнительныйРеквизит.ТипЗначения КАК ТипЗначения,
		|	CRM_ЗначенияКлассификаторов.Владелец.ХранитьИсториюИзменения КАК ХранитьИсториюИзменения
		|ИЗ
		|	Справочник.CRM_ЗначенияКлассификаторов КАК CRM_ЗначенияКлассификаторов
		|ГДЕ
		|	CRM_ЗначенияКлассификаторов.Владелец = &Классификатор
		|	И НЕ CRM_ЗначенияКлассификаторов.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_ЗначенияКлассификаторов.Владелец.РеквизитДопУпорядочивания,
		|	CRM_ЗначенияКлассификаторов.РеквизитДопУпорядочивания";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Сч = 1;
	                                                        		
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ШаблонИмени = ПолучитьШаблонИмени(Выборка.Код + "_" + Выборка.ВладелецНаименование);
		
		Элемент = ЭтаФорма.Элементы.Добавить(ИмяТаблицы + "_" + Формат(Сч, "ЧГ="), Тип("ПолеФормы"), Элементы.ПоляЗначенийКлассифкатора);
		Элемент.ПутьКДанным	= ИмяТаблицы + "." + ШаблонИмени;
		
		Если ЗначениеЗаполнено(Выборка.ДополнительныйРеквизит) Тогда
			Если ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(Выборка.ТипЗначения, Тип("Булево")) Тогда
				Элемент.Вид = ВидПоляФормы.ПолеФлажка;
			Иначе	
				Элемент.Вид = ВидПоляФормы.ПолеВвода;
			КонецЕсли;
		Иначе			
			Элемент.Вид = ВидПоляФормы.ПолеФлажка;
		КонецЕсли;
		
		Элемент.Заголовок   = Выборка.Представление;
		Элемент.Подсказка   = Выборка.Описание;
		
		НоваяСтрока	= ТаблицаСоответстствияПолей.Добавить();
		
		НоваяСтрока.ШаблонИмени	= ШаблонИмени;
		НоваяСтрока.ИмяПоля 	= ИмяТаблицы + "_" + Формат(Сч, "ЧГ=");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.Аналитика = CRM_КлассификаторыВызовСервера.ПолучитьЗначениеИспользуемойАналитикиКлассификатора(Классификатор);
		
		Сч = Сч + 1;
		
	КонецЦикла;
	
	//Видимость	
	Элементы.СписокКонтекстноеМенюНазначитьВыделенным.Видимость = 
		(Классификатор.ВидОтображения <> Перечисления.CRM_ВидыОтображенияКлассификаторов.ДополнительныйРеквизит); 
	
КонецПроцедуры // СформироватьВыбранныеПоля()

&НаСервереБезКонтекста
Функция ПолучитьШаблонИмени(ИмяПоля)

	Если Найти(ИмяПоля, " ") Тогда
		Шаблон = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Ссылка.[%1]", "_" + ИмяПоля);
	Иначе	
		Шаблон = "Ссылка." + "_" + ИмяПоля;
	КонецЕсли;
	
	Возврат Шаблон;

КонецФункции // ПолучитьШаблонИмениПоСсылке()

&НаКлиентеНаСервереБезКонтекста
Функция НайтиСтрокуСоответствия(Форма, ИмяПоля)

	Перем СтрокаПоля;
	
	СтрокиПоля = Форма.ТаблицаСоответстствияПолей.НайтиСтроки(Новый Структура("ИмяПоля", ИмяПоля));
	Если СтрокиПоля.Количество() > 0 Тогда
		СтрокаПоля = СтрокиПоля[0];	
	КонецЕсли;
	
	Возврат СтрокаПоля;
	
КонецФункции // НайтиСтрокуСоответствия()

&НаКлиентеНаСервереБезКонтекста
Функция СформировтьСтруктуруСтрокиКлассификатора(СтрокаПоля)

	СтрокаКлассификатора = Новый Структура("Ссылка,
											|Представление,
											|ИмяПоля,
											|ШаблонИмени,
											|ВидОтображения,
											|Классификатор,
											|Аналитика,
											|ЗначениеРеквизита,
											|ХранитьИсториюИзменения");	

	ЗаполнитьЗначенияСвойств(СтрокаКлассификатора, СтрокаПоля);
	Возврат СтрокаКлассификатора;
	
КонецФункции // СформировтьСтруктуруСтрокиКлассификатора()

&НаКлиенте
Процедура ОбработатьДанныеСтрокиКлиент(ДанныеСтроки, ИмяПоля, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	СтрокаПоля = НайтиСтрокуСоответствия(ЭтаФорма, ИмяПоля);
	Если СтрокаПоля = Неопределено Тогда
		Возврат;
		
	КонецЕсли;
	
	СтрокаКлассификатора = СформировтьСтруктуруСтрокиКлассификатора(СтрокаПоля);
	Если ЗначениеЗаполнено(СтрокаПоля.ДополнительныйРеквизит) Тогда
		СтрокаКлассификатора.ЗначениеРеквизита = ДанныеСтроки[СтрокаПоля.ШаблонИмени];	
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Ссылка"		   	   , ДанныеСтроки.Ссылка);
		ПараметрыОповещения.Вставить("СтрокаКлассификатора", СтрокаКлассификатора);
		
		Оповещение = Новый ОписаниеОповещения("ОбработатьДанныеСтрокиКлиентЗавершение", ЭтотОбъект, ПараметрыОповещения);
		ПоказатьВводЗначения(Оповещение, СтрокаКлассификатора.ЗначениеРеквизита, Элементы[ИмяПоля].Заголовок, СтрокаПоля.ТипЗначения);  
		
	Иначе	
		ИзменитьКлассификатор(ДанныеСтроки.Ссылка, СтрокаКлассификатора, Не ДанныеСтроки[СтрокаПоля.ШаблонИмени], Истина);		
		
	КонецЕсли;
	
КонецПроцедуры // ОбработатьДанныеСтроки()

&НаКлиенте
Процедура ОбработатьДанныеСтрокиКлиентЗавершение(ЗначениеРеквизита, Конекст) Экспорт
	
	Если ЗначениеРеквизита = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	СтрокаКлассификатора = Конекст.СтрокаКлассификатора;
	СтрокаКлассификатора.ЗначениеРеквизита = ЗначениеРеквизита;
	
	ИзменитьКлассификатор(Конекст.Ссылка, СтрокаКлассификатора, ЗначениеЗаполнено(ЗначениеРеквизита), Истина);		
	
	Элементы.Список.Обновить();
	
КонецПроцедуры // ОбработатьДанныеСтрокиКлиентЗавершение()

&НаСервере
Процедура ИзменитьКлассификатор(ОбъектСсылка, СтрокаКлассификатора, Включить, Рекурсивно = Ложь)
	
	НачатьТранзакцию();
	
	НаборЗаписей = РегистрыСведений.CRM_ОбъектыЗначенийКлассификаторов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ОбъектСсылка);
	НаборЗаписей.Отбор.Аналитика.Установить(СтрокаКлассификатора.Аналитика);
	НаборЗаписей.Отбор.ЗначениеКлассификатора.Установить(СтрокаКлассификатора.Ссылка);
	НаборЗаписей.Прочитать();
	
	НаборЗаписей.Очистить();
	Если Включить Тогда
		Запись = НаборЗаписей.Добавить();
		
		Запись.Объект  				   = ОбъектСсылка;
		Запись.Аналитика			   = СтрокаКлассификатора.Аналитика;		
		Запись.ЗначениеКлассификатора  = СтрокаКлассификатора.Ссылка;
		Запись.ЗначениеРеквизита  	   = СтрокаКлассификатора.ЗначениеРеквизита;
		Запись.ДатаВключения		   = ТекущаяДата();
		Запись.ХранитьИсториюИзменения = СтрокаКлассификатора.ХранитьИсториюИзменения;
		
	КонецЕсли;	
	
	НаборЗаписей.Записать();
	
	Если Рекурсивно И СтрокаКлассификатора.ВидОтображения = Перечисления.CRM_ВидыОтображенияКлассификаторов.ОдиночноеЗначение Тогда
		Для каждого СтрокаОписания Из ТаблицаСоответстствияПолей Цикл
			Если СтрокаОписания.Ссылка = СтрокаКлассификатора.Ссылка Тогда
				Продолжить;
			
			КонецЕсли;
			
			ИзменитьКлассификатор(ОбъектСсылка, СтрокаОписания, Ложь);
			
		КонецЦикла;
		
	
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // ИзменитьКлассификатор()

&НаКлиенте
Процедура УстановитьОтборПоКлассификаторам(Знач ЗначенияКлассификаторов = Неопределено, Знач ЗначенияРеквизитов = Неопределено)

	//Значения
	Если ЗначенияКлассификаторов = Неопределено Тогда
		ЗначенияКлассификаторов = ОтборСписокЗначенийКлассификаторов.ВыгрузитьЗначения();
		
	Иначе
		ОтборСписокЗначенийКлассификаторов.ЗагрузитьЗначения(ЗначенияКлассификаторов);
		
	КонецЕсли;
	
	//Реквизиты
	Если ЗначенияРеквизитов = Неопределено Тогда
		ЗначенияРеквизитов = ОтборСписокЗначенийРеквизитовКлассификаторов.ВыгрузитьЗначения();
		
	Иначе
		ОтборСписокЗначенийРеквизитовКлассификаторов.ЗагрузитьЗначения(ЗначенияРеквизитов);
		
	КонецЕсли;	
	
	ГруппаИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы, "ГруппаИЛИЗначенийИРеквизитовКлассификатора", 
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);	
		
	Если ЗначенияКлассификаторов.Количество() > 0 Тогда
		КоличествоЭлементовОтбора = ЗначенияКлассификаторов.Количество();
		Для Сч = 0 По КоличествоЭлементовОтбора - 1 Цикл
			ГруппаИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ГруппаИЛИ.Элементы, "ГруппаИЗначенийИРеквизитовКлассификатора" + Формат(Сч, "ЧГ="), 
				ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);	
				
			ЭлементЗначенияКлассификаторов 			= ЗначенияКлассификаторов[Сч];	
			ЭлементЗначенияРеквизитаКлассификаторов = ЗначенияРеквизитов[Сч];	
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаИ, 
				"ЗначениеКлассификатора", ЭлементЗначенияКлассификаторов, ВидСравненияКомпоновкиДанных.Равно);
			
			Если ТипЗнч(ЭлементЗначенияРеквизитаКлассификаторов) = Тип("Число") Тогда
				ВидСравненияСписка = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;	
			Иначе	
				ВидСравненияСписка = ВидСравненияКомпоновкиДанных.Равно;	
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаИ, 
				"ЗначениеРеквизита", ЭлементЗначенияРеквизитаКлассификаторов, ВидСравненияСписка);
		
		КонецЦикла;
				
	КонецЕсли;
	
	ИспользуетсяОтборПоКлассификатору = ЗначенияКлассификаторов.Количество() > 0;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, 
		"ЛогическоеВыражение", ЛогическоеВыражениеОтбораКлассификаторов, ИспользуетсяОтборПоКлассификатору);	
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, 
		"КоличествоЗначенийКлассификатора", ЗначенияКлассификаторов.Количество(), ИспользуетсяОтборПоКлассификатору);	
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, 
		"ИспользуетсяОтборПоКлассификатору", Истина, ИспользуетсяОтборПоКлассификатору);	

	ОбновитьОтображениеУстановленныхОтборов();
	УстановитьРежимПросмотраСписка();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры // УстановитьОтборПоКлассификаторам()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрыСписковПоНастройкам(Форма)
	
	КонецПериода  = КонецДня(ТекущаяДата());
	НачалоПериода = CRM_КлассификаторыКлиентСервер.РассчитатьНачалоПериода(КонецПериода, Форма.Настройки.ИнтервалПродаж, Форма.Настройки.ПериодичностьПродаж);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "НачалоПериода", НачалоПериода);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "КонецПериода" , КонецПериода);	
	
КонецПроцедуры // УстановитьПараметрыСписковПоНастройкам()

&НаСервере
Процедура ОбновитьОтображениеУстановленныхОтборов()
	
	МассивЭлементовОтбора = Новый Массив;
	Для каждого ЭлементОтбора Из Элементы.ГруппаУстановленныеОтборы.ПодчиненныеЭлементы Цикл
		МассивЭлементовОтбора.Добавить(ЭлементОтбора);
		
	КонецЦикла;
	
	Для каждого ЭлементОтбора Из МассивЭлементовОтбора Цикл
		Элементы.Удалить(ЭлементОтбора);	
		
	КонецЦикла;
	
	Для каждого ЭлементСписка Из ОтборСписокЗначенийКлассификаторов Цикл
		Значение = ЭлементСписка.Значение;
		ИмяОписания = "Значение__" + ИдентификаторЭлемента(Значение);	
		
		Представление = Строка(Значение);
		Если СтрДлина(Представление) > 15 Тогда
			Представление = Лев(Представление, 15) + "...";
			Ширина	 	  = 15 - 1;
			
		Иначе
			Ширина = СтрДлина(Представление) + 1;
			
		КонецЕсли;
		
		Компоненты = Новый Массив;
		Компоненты.Добавить(Новый ФорматированнаяСтрока(Представление + " "));
		Компоненты.Добавить(Новый ФорматированнаяСтрока(БиблиотекаКартинок.Очистить,,,, ИмяОписания));
		
		Элемент = Элементы.Найти(ИмяОписания);
		Если Элемент = Неопределено Тогда
			Элемент = Элементы.Добавить(
				ИмяОписания, Тип("ДекорацияФормы"), Элементы.ГруппаУстановленныеОтборы);
							
		КонецЕсли;

		Элемент.Вид						= ВидДекорацииФормы.Надпись;
		Элемент.Заголовок 				= Новый ФорматированнаяСтрока(Компоненты);
		Элемент.ЦветФона  			    = ЦветаСтиля.ЦветФонаФормы;
		Элемент.Рамка     			    = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная, 1);
		Элемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		Элемент.Ширина				    = Ширина;
		
		Элемент.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_ЗначениеОтбора_ОбработкаСсылки");
		
	КонецЦикла;
	
	ДекорацияЛогическоеВыражениеВидимость = ОтборСписокЗначенийКлассификаторов.Количество() > 0;
	Если ДекорацияЛогическоеВыражениеВидимость Тогда
		Элементы.ДекорацияЛогическоеВыражениеОтбораКлассификаторов.Заголовок = ?(ЛогическоеВыражениеОтбораКлассификаторов = "ИЛИ", НСтр("ru = 'Один из: '"), НСтр("ru = 'Все: '"));
	КонецЕсли;
	Элементы.ДекорацияЛогическоеВыражениеОтбораКлассификаторов.Видимость = ДекорацияЛогическоеВыражениеВидимость;
	
КонецПроцедуры // ОбновитьОтображениеУстановленныхОтборов()

&НаСервереБезКонтекста
Функция ИдентификаторЭлемента(Ссылка)

	Возврат СтрЗаменить(Ссылка.УникальныйИдентификатор(), "-", "_");	
	
КонецФункции // ИдентификаторЭлемента()

&НаСервереБезКонтекста
Функция СсылкаЭлемента(ИмяЭлемента)
	
	МассивИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяЭлемента, "__");	

	Возврат Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(
		Новый УникальныйИдентификатор(СтрЗаменить(МассивИмени[1], "_", "-"))
	);
	
КонецФункции // СсылкаЭлемента()

&НаСервере
Процедура СохранитьНастройки(СохраняемыеНастройки)
	
	Настройки = СохраняемыеНастройки;
	CRM_ХранилищеНастроек.Сохранить(ЭтотОбъект.ИмяФормы, "Настройки", СохраняемыеНастройки);	
	
КонецПроцедуры // СохранитьНастройки()

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьНастройкиПоУмолчанию()

	Настройки = Новый Структура;
	Настройки.Вставить("ИнтервалПродаж"		, 1);
	Настройки.Вставить("ПериодичностьПродаж", ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	
	Возврат Настройки;

КонецФункции // ПолучитьНастройкиПоУмолчанию()

&НаКлиенте
Процедура УстановитьБыстрыеОтборы()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		"НаправлениеДеятельности", ОтборНаправлениеДеятельности,,, ЗначениеЗаполнено(ОтборНаправлениеДеятельности)
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		"НоменклатурнаяГруппа", ОтборНоменклатурнаяГруппа,,, ЗначениеЗаполнено(ОтборНоменклатурнаяГруппа)
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		"ПродажиСумма", ОтборПродажиСумма, ВидСравненияКомпоновкиДанных[ОтборПродажиСуммаВидСравнения],, ЗначениеЗаполнено(ОтборПродажиСумма)
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		"ДатаВключения", ОтборДатаВключенияКлассификатора, ВидСравненияКомпоновкиДанных[ОтборДатаВключенияКлассификатораВидСравнения],, ЗначениеЗаполнено(ОтборДатаВключенияКлассификатора)
	);
		
	УстановитьРежимПросмотраСписка();
	
КонецПроцедуры // УстановитьБыстрыеОтборы()

&НаКлиенте
Процедура УстановитьРежимПросмотраСписка()
	
	Если ОтборСписокЗначенийКлассификаторов.Количество() > 0
	  ИЛИ ЗначениеЗаполнено(ОтборНаправлениеДеятельности)
	  ИЛИ ЗначениеЗаполнено(ОтборНоменклатурнаяГруппа)
	  ИЛИ ЗначениеЗаполнено(ОтборПродажиСумма)
	  ИЛИ ЗначениеЗаполнено(ОтборДатаВключенияКлассификатора) 
	  ИЛИ РежимСписка Тогда
	  
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		
	Иначе	
		Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
		
	КонецЕсли;

КонецПроцедуры // УстановитьРежимПросмотраСписка()

#Область ВариантыСписка

&НаСервере
Процедура ВариантСпискаПриИзменении(ИмяКоманды)
	CRM_КлассификаторыВызовСервера.ИницализироватьНаборДанныхСписка(ЭтотОбъект, ИмяКоманды, ПолучитьПараметрыСписка());
КонецПроцедуры // ВариантСпискаПриИзменении()

&НаСервере
Процедура ИнициализироватьВариантыСписка(ИмяСписка, ВариантСписка)
	
	ПараметрыСписка = ПолучитьПараметрыСписка();
	Если ИмяСписка <> ПараметрыСписка.ИмяСписка Тогда
		Возврат;
		
	КонецЕсли;
	
	ПараметрыСписка.Вставить("ТекущийВариантСписка", ВариантСписка);
	CRM_КлассификаторыВызовСервера.ИнициализироватьВариантыСписка(ЭтотОбъект, ПараметрыСписка);
	
КонецПроцедуры // ИнициализироватьВариантыСписка()

&НаСервере
Функция ПолучитьПараметрыСписка()

	ПараметрыСписка = Новый Структура;
	ПараметрыСписка.Вставить("ИмяСписка"      	 , "СписокНоменклатура");
	ПараметрыСписка.Вставить("ОсновнаяТаблица"	 , "Справочник.Номенклатура");
	ПараметрыСписка.Вставить("ЭлементСписка"  	 , Элементы.Список);
	ПараметрыСписка.Вставить("ОбластьВарианты"   , Элементы.СписокГруппаВариантыСписка);
	ПараметрыСписка.Вставить("ОбластьДобавления" , Элементы.ПоляСписка);

	Возврат ПараметрыСписка;
	
КонецФункции // ПолучитьПараметрыСписка()

#КонецОбласти

#Область Настройки

&НаКлиенте
Процедура ИнициализироватьФормуПоНастройкеКлиент()
	
	Настройка = ПолучитьНастройкиПоСсылке(ТекущаяНастройка["СписокНоменклатура"]);
	Если Настройка <> Неопределено Тогда
		ИнициализироватьНастройки(Настройка);	
	КонецЕсли;
	
	СформироватьЗаголовокПоНастройке(ЭтотОбъект);
	
КонецПроцедуры // ИнициализироватьФормуПоНастройкеКлиент()

&НаКлиенте
Процедура ИнициализироватьНастройки(Настройка)

	ИмяСписка = "СписокНоменклатура";
	
	//Вариант списка
	ТекущийВариантСписка[ИмяСписка] = Настройка.ВариантСписка;
	ВариантСпискаПриИзменении(?(ЗначениеЗаполнено(Настройка.ВариантСписка), Настройка.ВариантСписка, "ОсновнойВариант" + ИмяСписка));
	
	//Классификатор
	Классификатор = Настройка.Классификатор;
	ИницализироватьСтруктуруКлассификатора();	
	
	//Отбор по классификатору
	ЛогическоеВыражениеОтбораКлассификаторов = Настройка.ЛогическоеВыражениеОтбораКлассификаторов;
	
	ОтборСписокЗначенийКлассификаторов.Очистить();
	Для каждого ЭлементОтбора Из Настройка.ОтборСписокЗначенийКлассификаторов Цикл
		ОтборСписокЗначенийКлассификаторов.Добавить(ЭлементОтбора.Значение, ЭлементОтбора.Представление);	
	КонецЦикла;
	
	УстановитьОтборПоКлассификаторам();
	
	//Быстрые отборы
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Настройка.БыстрыеОтборы);
	УстановитьБыстрыеОтборы();	
	
КонецПроцедуры // ИнициализироватьНастройки()

&НаСервереБезКонтекста
Функция ПолучитьНастройкиПоСсылке(НастрокаСсылка)
	Возврат Справочники.вогНастройкиУправленияКлассификацией.ПолучитьНастройки(НастрокаСсылка);	
КонецФункции // ПолучитьНастройкиПоСсылке()

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьЗаголовокПоНастройке(Форма)
	
	Настройка = Форма.ТекущаяНастройка["СписокНоменклатура"];
	Форма.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Номенклатура (%1)'"), 
		?(ЗначениеЗаполнено(Настройка), Настройка, НСтр("ru = 'по умолчанию'"))); 
	
КонецПроцедуры // СформироватьЗаголовокПоНастройке()

#КонецОбласти

#КонецОбласти

#Область Подключаемый_РабочийСтол
	
&НаКлиенте
Процедура Подключаемый_скТумблерРабочегоСтолаПриИзменении(Элемент)
	скРабочийСтолКлиент.ТумблерРабочегоСтолаПриИзменении(ЭтаФорма, Элемент);
КонецПроцедуры // Подключаемый_скТумблерРабочегоСтолаПриИзменении()

&НаКлиенте
Процедура Подключаемый_ОбработкаГипперссылкиДействийНажатие(Элемент)
	скРабочийСтолКлиент.ОбработкаГипперссылкиДействийНажатие(ЭтаФорма, Элемент);	
КонецПроцедуры // Подключаемый_ИндикаторНапоминанийНажатие()

&НаКлиенте
Процедура Подключаемый_ОбновитьТаблицуНапоминаний(МассивНапоминаний = Неопределено) Экспорт
	скРабочийСтолКлиент.ОбновитьТаблицуНапоминаний(ЭтаФорма, МассивНапоминаний);
КонецПроцедуры // Подключаемый_ОбновитьТаблицуНапоминаний()

&НаКлиенте
Процедура Подключаемый_НапоминанияСкрытьНажатие(Элемент)
	скРабочийСтолКлиент.СкрытьНапоминания(ЭтаФорма);	
КонецПроцедуры // Подключаемый_НапоминанияСкрытьНажатие()

&НаКлиенте
Процедура Подключаемый_ПолеHTMLНапоминанийПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	скРабочийСтолКлиент.ПолеHTMLНапоминанийПриНажатии(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_ПолеHTMLНапоминанийПриНажатии()

&НаКлиенте
Процедура Подключаемый_КомандаНапоминанийПрекратитьВсе(Команда)
	скРабочийСтолКлиент.КомандаНапоминанийПрекратитьВсе(ЭтаФорма, Команда);
КонецПроцедуры // Подключаемый_КомандаНапоминанийПрекратитьВсе()

&НаКлиенте
Процедура Подключаемый_КомандаНапоминанийПеренестиВсе(Команда)
	скРабочийСтолКлиент.КомандаНапоминанийПеренестиВсе(ЭтаФорма, Команда);
КонецПроцедуры // Подключаемый_КомандаНапоминанийПрекратитьВсе()

&НаКлиенте
Процедура Подключаемый_ЗаметкиСкрытьНажатие(Элемент)
	скРабочийСтолКлиент.СкрытьЗаметки(ЭтаФорма);	
КонецПроцедуры // Подключаемый_ЗаметкиСкрытьНажатие()

&НаКлиенте
Процедура Подключаемый_ПолеHTMLЗаметокПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	скРабочийСтолКлиент.ПолеHTMLЗаметокПриНажатии(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_ПолеHTMLЗаметокПриНажатии()

&НаКлиенте
Процедура Подключаемый_КомандаЗаметкиВсе(Команда)
	скРабочийСтолКлиент.КомандаЗаметкиВсе(ЭтаФорма, Команда);
КонецПроцедуры // Подключаемый_КомандаЗаметкиВсе()

&НаКлиенте
Процедура Подключаемый_КомандаЗаметкиДобавить(Команда)
	скРабочийСтолКлиент.КомандаЗаметкиДобавить(ЭтаФорма, Команда);
КонецПроцедуры // Подключаемый_КомандаЗаметкиДобавить()

&НаКлиенте
Процедура Подключаемый_ИсторияРаботыСкрытьНажатие(Элемент)
	скРабочийСтолКлиент.СкрытьИсториюРаботы(ЭтаФорма);	
КонецПроцедуры // Подключаемый_ИсторияРаботыСкрытьНажатие()

&НаКлиенте
Процедура Подключаемый_ПолеHTMLИсторииРаботыПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	скРабочийСтолКлиент.ПолеHTMLИсторииРаботыПриНажатии(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_ПолеHTMLИсторииРаботыПриНажатии()

#КонецОбласти
//-Рабочий стол
